{
  "title": "Secrets at Rosie's Diner",
  "difficulty": "Easy",
  "credits": [
    {
      "image_path": "static/images/characters/man_redhat.png",
      "credit_html": "<a href=\"https://www.flaticon.com/free-icons/man-redhat\" title=\"man redhat icons\">Man redhat icons created by Freepik - Flaticon</a>"
    },
    {
      "image_path": "static/images/characters/granny.png",
      "credit_html": "<a href=\"https://www.flaticon.com/free-icons/granny\" title=\"granny icons\">Granny icons created by Freepik - Flaticon</a>"
    },
    {
      "image_path": "static/images/characters/policeman.png",
      "credit_html": "<a href=\"https://www.flaticon.com/free-icons/policeman\" title=\"policeman icons\">Policeman icons created by Freepik - Flaticon</a>"
    },
    {
      "image_path": "static/images/characters/man_beard.png",
      "credit_html": "<a href=\"https://www.flaticon.com/free-icons/man-beard\" title=\"man beard icons\">Man beard icons created by Freepik - Flaticon</a>"
    },
    {
      "image_path": "static/images/characters/woman_yellow.png",
      "credit_html": "<a href=\"https://www.flaticon.com/free-icons/woman-yellow\" title=\"woman yellow icons\">Woman yellow icons created by Freepik - Flaticon</a>"
    }
  ],
  "introduction": "Rosie's Diner has been the heart of Millbrook, a small farming town, for over thirty years. Every morning, the same regulars gather for coffee and gossip before starting their day. But this foggy Tuesday morning, when waitress Betty Lou arrives to open up at 5 AM, she discovers the diner's beloved owner, Rosie Martinez, lying motionless behind the counter. The front door was locked, but someone with a key gained entry during the night. In a town where everyone knows everyone else's business, secrets run deep beneath the surface of small-town friendliness. With only a handful of people who had access to the diner, you must uncover which trusted member of this tight-knit community betrayed Rosie's faith.",
  "narrator_tts": [
    {
      "engine": "google",
      "model": "en-US-Chirp-HD-O"
    }
  ],
  "victim": "Rosie Martinez (Diner Owner)",
  "killer": "Frank Thompson",
  "weapon": "Blunt force trauma (cast iron skillet)",
  "location": "Behind the counter at Rosie's Diner",
  "motive": "Frank owes massive gambling debts to dangerous people. Rosie discovered he'd been skimming money from the town's charity fund that she helped manage and threatened to expose him.",
  "characters": [
    {
      "name": "Frank Thompson",
      "sprite": "static/images/characters/man_redhat.png",
      "personality": "Friendly local handyman who seems genuinely upset by Rosie's death, but is hiding his financial desperation",
      "knowledge": [
        "Rosie always arrived at the diner by 4:30 AM to prep for the morning rush",
        "The back door lock has been sticking lately and needs jiggling",
        "Rosie kept the week's earnings in an old coffee tin behind the register",
        "She had been acting worried about something lately"
      ],
      "reliable": false,
      "tts": [{"engine": "google", "model": "en-US-Chirp-HD-D"}],
      "secrets": [
        "He owes $50,000 to loan sharks who threatened his family",
        "He's been taking small amounts from the town charity fund for months",
        "Rosie confronted him yesterday about the missing money"
      ]
    },
    {
      "name": "Betty Lou Williams",
      "sprite": "static/images/characters/granny.png",
      "personality": "Sweet, elderly waitress who's worked at the diner for 15 years and treated Rosie like family",
      "knowledge": [
        "Rosie had been staying late recently, going over the books",
        "Someone has been calling the diner late at night and hanging up",
        "Rosie mentioned being worried about the town charity fund",
        "The kitchen window latch is broken and can be opened from outside"
      ],
      "reliable": true,
      "tts": [{"engine": "google", "model": "en-US-Chirp-HD-F"}],
      "secrets": [
        "She saw Frank's truck parked behind the diner very early this morning",
        "Rosie asked her yesterday who else had keys to the diner"
      ]
    },
    {
      "name": "Deputy Tom Bradley",
      "sprite": "static/images/characters/policeman.png",
      "personality": "Young, earnest small-town cop who's responding to his first murder case and is overwhelmed",
      "knowledge": [
        "There have been reports of suspicious activity around town lately",
        "Rosie called the station two days ago asking about filing a report but never followed up",
        "The diner's cash register appears untouched",
        "No signs of forced entry at any of the doors"
      ],
      "reliable": true,
      "tts": [{"engine": "google", "model": "en-US-Chirp-HD-D"}],
      "secrets": [
        "Frank has been asking a lot of questions about statute of limitations on embezzlement",
        "Rosie seemed nervous when she called about filing that report"
      ]
    },
    {
      "name": "Pastor David Chen",
      "sprite": "static/images/characters/man_beard.png",
      "personality": "Compassionate local minister who knew everyone's struggles and is heartbroken by the tragedy",
      "knowledge": [
        "Rosie was very active in church charity work and managed several community funds",
        "Frank has been under financial stress and asked for prayer",
        "Rosie had been counting and recounting charity donations recently",
        "She mentioned being disappointed in someone she trusted"
      ],
      "reliable": true,
      "tts": [{"engine": "google", "model": "en-US-Chirp-HD-O"}],
      "secrets": [
        "Frank confessed to him about gambling problems but made him promise not to tell anyone",
        "Rosie asked him yesterday about forgiveness for people who steal from charity"
      ]
    },
    {
      "name": "Martha Pike",
      "sprite": "static/images/characters/woman_yellow.png",
      "personality": "Nosy town gossip who knows everyone's business and loves to share what she's observed",
      "knowledge": [
        "Frank's been working odd hours lately, coming and going at strange times",
        "Rosie had a heated phone conversation with someone yesterday afternoon",
        "The charity fund was supposed to be announced at this Sunday's church service",
        "Frank asked her last week about pawn shops in the next town over"
      ],
      "reliable": true,
      "tts": [{"engine": "google", "model": "en-US-Chirp-HD-F"}],
      "secrets": [
        "She saw Frank arguing with some tough-looking strangers outside the bar last week",
        "Rosie seemed scared when she mentioned Frank's name yesterday"
      ]
    }
  ]
}